Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionTextAttributes Constructor (FontAttributes, DimensionSetBaseAttributes.FrameTypes, DimensionSetBaseAttributes.DimensionTextPlacings)
 Creates a new dimension text attributes instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionTextAttributes(
	FontAttributes font,
	DimensionSetBaseAttributes.FrameTypes frame,
	DimensionSetBaseAttributes.DimensionTextPlacings textPlacing
)
Public Sub New (
	font As FontAttributes,
	frame As DimensionSetBaseAttributes.FrameTypes,
	textPlacing As DimensionSetBaseAttributes.DimensionTextPlacings
)
Parameters
font
Type: Tekla.Structures.Drawing.FontAttributes
The font attributes of the dimension value text.
frame
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.FrameTypes
The frame type of the dimension value text.
textPlacing
Type: Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionTextPlacings
The place of the dimension value text.
See Also
Reference
DimensionSetBaseAttributes.DimensionTextAttributes Class
DimensionSetBaseAttributes.DimensionTextAttributes Overload
Tekla.Structures.Drawing Namespace